#ifndef STRUCTURES_H
#define STRUCTURES_H
#include "helperfunctions.h"

typedef struct Player Player, *PPlayer;
typedef struct Player_vtbl Player_vtbl, *PPlayer_vtbl;
typedef struct Player2 Player2, *PPlayer2;

struct Player {
    Player_vtbl *__vftable;
    char pad00[0xC4]; 
    double posx1; //0xC8
    double posy1; //0xD0
    double posz1; //0xD8
    float angleA; //0xE0
    float angleB; //0xE4
    char pad01[0x18]; //0xE8
    double posx2; //0x100
    double posy2; //0x108
    double posz2; //0x110
    double posx3; //0x118
    double posy3; //0x120
    double posz3; //0x128
    char pad02[0x18]; //0x130
    float angle1; //0x148
    float angle2; //0x14C
    float angle3; //0x150
    float angle4; //0x154
    float angle5; //0x158
    float angle6; //0x15C
    char pad03[0x60]; //0x160
    double posx4; //0x1C0
    double posy4; //0x1C8
    double posz4; //0x1D0
    char pad04[0x6F0]; //0x1D8
    double posx5; //0x8C8
    double posy5; //0x8D0
    double posz5; //0x8D8

    //unsigned char extraData[0xA8C];
}; // i think this was around 0xA90 bytes?
struct Player2 {
    unsigned char extraData[0xA90];
    //struct Player_vtbl *__vftable;
    //unsigned char extraData[0xA8C];
};

typedef struct {
    double x;
    double y;
    double z;
} Vec3;

#define undefRet int
typedef undefRet (*FunctionType)(Player* player);
#define undefPlayerFun FunctionType

struct Player_vtbl { /* vtable of Player */
    char pad00[0x30]; // 0x0
    undefPlayerFun GetType; //fjDerivedCtorCalls__12LivingEntityFv
    undefPlayerFun fjDerivedCtorCalls__12LivingEntityFv; //fjDerivedCtorCalls__12LivingEntityFv
    undefPlayerFun kill__12LivingEntityFv; //kill__12LivingEntityFv
    undefPlayerFun defineSynchedData__6PlayerFv; //defineSynchedData__6PlayerFv
    undefPlayerFun resetPos__6PlayerFv; //resetPos__6PlayerFv
    undefPlayerFun remove__6PlayerFv; //remove__6PlayerFv
    undefPlayerFun setDropContainerContent__6EntityFb; //setDropContainerContent__6EntityFb
    undefPlayerFun setSize__6EntityFfT1; //setSize__6EntityFfT1
    undefPlayerFun setPos__6EntityFdN21; //setPos__6EntityFdN21
    undefPlayerFun tick__6PlayerFv; //tick__6PlayerFv
    undefPlayerFun baseTick__12LivingEntityFv; //baseTick__12LivingEntityFv
    undefPlayerFun processDimensionDelay__6EntityFv; //processDimensionDelay__6EntityFv
    undefPlayerFun getPortalWaitTime__6PlayerFv; //getPortalWaitTime__6PlayerFv
    undefPlayerFun setSecondsOnFire__6EntityFi; //setSecondsOnFire__6EntityFi
    undefPlayerFun clearFire__6EntityFv; //clearFire__6EntityFv
    undefPlayerFun outOfWorld__12LivingEntityFv; //outOfWorld__12LivingEntityFv
    undefPlayerFun move__6EntityF9MoverTypedN22b; //move__6EntityF9MoverTypedN22b
    undefPlayerFun updateDeltaAfterMove__6EntityFP5BlockdN22RdN25; //updateDeltaAfterMove__6EntityFP5BlockdN22RdN25
    undefPlayerFun setLocationFromBoundingbox__6EntityFv; //setLocationFromBoundingbox__6EntityFv
    undefPlayerFun getSwimSound__6PlayerFv; //getSwimSound__6PlayerFv
    undefPlayerFun getSwimSplashSound__6PlayerFv; //getSwimSplashSound__6PlayerFv
    undefPlayerFun getHeavySplashSound__6PlayerFv; //getHeavySplashSound__6PlayerFv
    undefPlayerFun checkInsideBlocks__6EntityFv; //checkInsideBlocks__6EntityFv
    undefPlayerFun onInsideBlock__6EntityFPC10BlockState; //onInsideBlock__6EntityFPC10BlockState
    undefPlayerFun playStepSound__6EntityFRC8BlockPosP5Block; //playStepSound__6EntityFRC8BlockPosP5Block
    undefPlayerFun playUnderwaterSound__6EntityFRC8BlockPosP5Block; //playUnderwaterSound__6EntityFRC8BlockPosP5Block
    undefPlayerFun playFlySound__6EntityFf; //playFlySound__6EntityFf
    undefPlayerFun makeFlySound__6EntityFv; //makeFlySound__6EntityFv
    undefPlayerFun playSound__6PlayerFPC10SoundEventfT2; //playSound__6PlayerFPC10SoundEventfT2
    undefPlayerFun isSilent__6EntityFv; //isSilent__6EntityFv
    undefPlayerFun setSilent__6EntityFb; //setSilent__6EntityFb
    undefPlayerFun isNoGravity__6EntityFv; //isNoGravity__6EntityFv
    undefPlayerFun setNoGravity__6EntityFb; //setNoGravity__6EntityFb
    undefPlayerFun isMoving__6EntityFv; //isMoving__6EntityFv
    undefPlayerFun setMoving__6EntityFb; //setMoving__6EntityFb
    undefPlayerFun makeStepSound__6PlayerFv; //makeStepSound__6PlayerFv
    undefPlayerFun checkFallDamage__12LivingEntityFdbP5BlockRC8BlockPos; //checkFallDamage__12LivingEntityFdbP5BlockRC8BlockPos
    undefPlayerFun getCollideBox__6EntityFv; //getCollideBox__6EntityFv
    undefPlayerFun burn__6EntityFi; //burn__6EntityFi
    undefPlayerFun causeFallDamage__6PlayerFfT1; //causeFallDamage__6PlayerFfT1
    undefPlayerFun isInWater__6EntityFv; //isInWater__6EntityFv
    undefPlayerFun headInWater__6EntityFv; //headInWater__6EntityFv
    undefPlayerFun isOverWater__6EntityFv; //isOverWater__6EntityFv
    undefPlayerFun updateInWaterState__6EntityFv; //updateInWaterState__6EntityFv
    undefPlayerFun doWaterSplashEffect__6PlayerFv; //doWaterSplashEffect__6PlayerFv
    undefPlayerFun updateSprintingState;
    undefPlayerFun doSprintParticleEffect; // 0xE8
    
    undefRet (*isUnderLiquid)(Player* player, int a1); // 0xEC
    undefRet (*isInLiquid)(Player* player, int a1, double *a2); // 0xF0
    undefRet (*getLightColor)(Player* player); // 0xF4
    double (*getBrightness) (Player* player); // 0xF8
    undefRet (*setLevel) (Player* player, int a1); // 0xFC


    int (*moveTo)(Player* player, double x, double y, double z, double angle1, double angle2); // 0x100

    undefPlayerFun playerTouch__6EntityFQ2_5boost25shared_ptr__tm__8_6Player; // 0x104
    undefPlayerFun push__6PlayerFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun push__6EntityFdN21;
    undefPlayerFun markHurt__12LivingEntityFv;
    undefPlayerFun hurt__6PlayerFPC12DamageSourcef;
    undefPlayerFun getViewVector__12LivingEntityFf;
    undefPlayerFun isPickable__6PlayerFv;
    undefPlayerFun isPushable__12LivingEntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun awardKillScore__6EntityFQ2_5boost25shared_ptr__tm__8_6EntityiPC12DamageSource;
    undefPlayerFun shouldRender__6EntityFdN21;
    undefPlayerFun shouldRender__6EntityFd;
    undefPlayerFun shouldRenderAtSqrDistance__6PlayerFd;
    undefPlayerFun save__6EntityFP11CompoundTag;
    undefPlayerFun load__6EntityFP11CompoundTag;
    undefPlayerFun shouldTick__6PlayerFv;
    undefPlayerFun repositionEntityAfterLoad__6EntityFv;
    undefPlayerFun readAdditionalSaveData__6PlayerFP11CompoundTag;
    undefPlayerFun addAdditonalSaveData__6PlayerFP11CompoundTag;
    undefPlayerFun readAdditionContructionTag__6EntityFP11CompoundTag_9;
    undefPlayerFun getAdditionContructionTag__6EntityFv;
    undefPlayerFun spawnAtLocation__6EntityFP4Itemi;
    undefPlayerFun spawnAtLocation__6EntityFP4Itemif;
    undefPlayerFun spawnAtLocation__6EntityF35not_null_ptr__tm__15_12ItemInstancef;
    undefPlayerFun isAlive__12LivingEntityFv;
    undefPlayerFun isInWall__6PlayerFv;
    undefPlayerFun interact__6EntityFRCQ2_5boost25shared_ptr__tm__8_6PlayerQ2_15InteractionHand16EInteractionHand;
    undefPlayerFun getCollideAgainstBox__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun rideTick__6PlayerFv;
    undefPlayerFun positionRider__6EntityFRCQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun onPassengerTurned__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun getRidingHeight__6PlayerFv;
    undefPlayerFun getRideHeight__6EntityFv;
    undefPlayerFun showVehicleHealth__6EntityFv;
    undefPlayerFun startRiding__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun startRiding__6EntityFQ2_5boost25shared_ptr__tm__8_6Entityb;
    undefPlayerFun GetInteractTooltip__6EntityFRC23EntityTooltipDataHolder;
    undefPlayerFun GetHitTooltip__6EntityFRC23EntityTooltipDataHolder;
    undefPlayerFun HideUseTooltips__6EntityFv;
    undefPlayerFun canRide__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun ejectPassengers__6EntityFv;
    undefPlayerFun stopRiding__6PlayerFv;
    undefPlayerFun stopRidingBeforeTeleport__6EntityFv;
    undefPlayerFun addPassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun removePassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun canAddPassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefPlayerFun lerpTo__12LivingEntityFdN21fT4ib;
    undefPlayerFun getPickRadius__6EntityFv;
    undefPlayerFun getLookAngle__6EntityFv;
    undefPlayerFun getRotationVector__6EntityFv; // 0x1C4

    Vec3* (*getForward)(Player* player); // 0x1C8

    undefPlayerFun handleInsidePortal__6EntityFRC8BlockPos; // 0x1CC
    undefPlayerFun getDimensionChangingDelay__6PlayerFv;
    undefPlayerFun lerpMotion__6EntityFdN21;
    undefPlayerFun handleEntityEvent__6PlayerFUci;
    undefPlayerFun animateHurt__12LivingEntityFv;
    undefPlayerFun getHandSlots__6PlayerFv;
    undefPlayerFun getArmorSlots__6PlayerFv;
    undefPlayerFun getAllSlots__6EntityFv;
    undefPlayerFun setItemSlot__6PlayerFPC13EquipmentSlot35not_null_ptr__tm__15_12ItemInstance;
    undefPlayerFun isOnFire__6EntityFv;
    undefPlayerFun isPassenger__6EntityFv;
    undefPlayerFun isVehicle__6EntityFv;
    undefPlayerFun isSneaking__6EntityFv;
    undefPlayerFun setSneaking__6EntityFb;
    undefPlayerFun isIdle__6EntityFv;
    undefPlayerFun setIsIdle__6EntityFb;
    undefPlayerFun isSprinting__6EntityFv;
    undefPlayerFun setSprinting__12LivingEntityFb;
    undefPlayerFun isSwimming__6EntityFv;
    undefPlayerFun isSwimmer__6EntityFv;
