#ifndef STRUCTURES_H
#define STRUCTURES_H
#include "helperfunctions.h"

typedef struct Player Player, *PPlayer;

typedef struct Player_vtbl Player_vtbl, *PPlayer_vtbl;
typedef struct Player2 Player2, *PPlayer2;

struct Player {
    Player_vtbl *__vftable;
    char pad00[0xC4]; 
    double posx1; //0xC8
    double posy1; //0xD0
    double posz1; //0xD8
    float angleA; //0xE0
    float angleB; //0xE4
    char pad01[0x18]; //0xE8
    double posx2; //0x100
    double posy2; //0x108
    double posz2; //0x110
    double posx3; //0x118
    double posy3; //0x120
    double posz3; //0x128
    char pad02[0x18]; //0x130
    float angle1; //0x148
    float angle2; //0x14C
    float angle3; //0x150
    float angle4; //0x154
    float angle5; //0x158
    float angle6; //0x15C
    char pad03[0x60]; //0x160
    double posx4; //0x1C0
    double posy4; //0x1C8
    double posz4; //0x1D0
    char pad04[0x6F0]; //0x1D8
    double posx5; //0x8C8
    double posy5; //0x8D0
    double posz5; //0x8D8

    //unsigned char extraData[0xA8C];
}; // i think this was around 0xA90 bytes?
struct Player2 {
    unsigned char extraData[0xA90];
    //struct Player_vtbl *__vftable;
    //unsigned char extraData[0xA8C];
};

typedef struct {
    double x;
    double y;
    double z;
} Vec3;

#define undefRet int
typedef undefRet (*FunctionType)(Player* player);
#define undefinedFunction FunctionType

struct Player_vtbl { /* vtable of Player */
    char pad00[0x34]; // 0x0
    undefinedFunction fjDerivedCtorCalls__12LivingEntityFv; //fjDerivedCtorCalls__12LivingEntityFv
    undefinedFunction kill__12LivingEntityFv; //kill__12LivingEntityFv
    undefinedFunction defineSynchedData__6PlayerFv; //defineSynchedData__6PlayerFv
    undefinedFunction resetPos__6PlayerFv; //resetPos__6PlayerFv
    undefinedFunction remove__6PlayerFv; //remove__6PlayerFv
    undefinedFunction setDropContainerContent__6EntityFb; //setDropContainerContent__6EntityFb
    undefinedFunction setSize__6EntityFfT1; //setSize__6EntityFfT1
    undefinedFunction setPos__6EntityFdN21; //setPos__6EntityFdN21
    undefinedFunction tick__6PlayerFv; //tick__6PlayerFv
    undefinedFunction baseTick__12LivingEntityFv; //baseTick__12LivingEntityFv
    undefinedFunction processDimensionDelay__6EntityFv; //processDimensionDelay__6EntityFv
    undefinedFunction getPortalWaitTime__6PlayerFv; //getPortalWaitTime__6PlayerFv
    undefinedFunction setSecondsOnFire__6EntityFi; //setSecondsOnFire__6EntityFi
    undefinedFunction clearFire__6EntityFv; //clearFire__6EntityFv
    undefinedFunction outOfWorld__12LivingEntityFv; //outOfWorld__12LivingEntityFv
    undefinedFunction move__6EntityF9MoverTypedN22b; //move__6EntityF9MoverTypedN22b
    undefinedFunction updateDeltaAfterMove__6EntityFP5BlockdN22RdN25; //updateDeltaAfterMove__6EntityFP5BlockdN22RdN25
    undefinedFunction setLocationFromBoundingbox__6EntityFv; //setLocationFromBoundingbox__6EntityFv
    undefinedFunction getSwimSound__6PlayerFv; //getSwimSound__6PlayerFv
    undefinedFunction getSwimSplashSound__6PlayerFv; //getSwimSplashSound__6PlayerFv
    undefinedFunction getHeavySplashSound__6PlayerFv; //getHeavySplashSound__6PlayerFv
    undefinedFunction checkInsideBlocks__6EntityFv; //checkInsideBlocks__6EntityFv
    undefinedFunction onInsideBlock__6EntityFPC10BlockState; //onInsideBlock__6EntityFPC10BlockState
    undefinedFunction playStepSound__6EntityFRC8BlockPosP5Block; //playStepSound__6EntityFRC8BlockPosP5Block
    undefinedFunction playUnderwaterSound__6EntityFRC8BlockPosP5Block; //playUnderwaterSound__6EntityFRC8BlockPosP5Block
    undefinedFunction playFlySound__6EntityFf; //playFlySound__6EntityFf
    undefinedFunction makeFlySound__6EntityFv; //makeFlySound__6EntityFv
    undefinedFunction playSound__6PlayerFPC10SoundEventfT2; //playSound__6PlayerFPC10SoundEventfT2
    undefinedFunction isSilent__6EntityFv; //isSilent__6EntityFv
    undefinedFunction setSilent__6EntityFb; //setSilent__6EntityFb
    undefinedFunction isNoGravity__6EntityFv; //isNoGravity__6EntityFv
    undefinedFunction setNoGravity__6EntityFb; //setNoGravity__6EntityFb
    undefinedFunction isMoving__6EntityFv; //isMoving__6EntityFv
    undefinedFunction setMoving__6EntityFb; //setMoving__6EntityFb
    undefinedFunction makeStepSound__6PlayerFv; //makeStepSound__6PlayerFv
    undefinedFunction checkFallDamage__12LivingEntityFdbP5BlockRC8BlockPos; //checkFallDamage__12LivingEntityFdbP5BlockRC8BlockPos
    undefinedFunction getCollideBox__6EntityFv; //getCollideBox__6EntityFv
    undefinedFunction burn__6EntityFi; //burn__6EntityFi
    undefinedFunction causeFallDamage__6PlayerFfT1; //causeFallDamage__6PlayerFfT1
    undefinedFunction isInWater__6EntityFv; //isInWater__6EntityFv
    undefinedFunction headInWater__6EntityFv; //headInWater__6EntityFv
    undefinedFunction isOverWater__6EntityFv; //isOverWater__6EntityFv
    undefinedFunction updateInWaterState__6EntityFv; //updateInWaterState__6EntityFv
    undefinedFunction doWaterSplashEffect__6PlayerFv; //doWaterSplashEffect__6PlayerFv
    undefinedFunction updateSprintingState;
    undefinedFunction doSprintParticleEffect; // 0xE8
    
    undefRet (*isUnderLiquid)(Player* player, int a1); // 0xEC
    undefRet (*isInLiquid)(Player* player, int a1, double *a2); // 0xF0
    undefRet (*getLightColor)(Player* player); // 0xF4
    double (*getBrightness) (Player* player); // 0xF8
    undefRet (*setLevel) (Player* player, int a1); // 0xFC


    int (*moveTo)(Player* player, double x, double y, double z, double angle1, double angle2); // 0x100

    undefinedFunction playerTouch__6EntityFQ2_5boost25shared_ptr__tm__8_6Player; // 0x104
    undefinedFunction push__6PlayerFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction push__6EntityFdN21;
    undefinedFunction markHurt__12LivingEntityFv;
    undefinedFunction hurt__6PlayerFPC12DamageSourcef;
    undefinedFunction getViewVector__12LivingEntityFf;
    undefinedFunction isPickable__6PlayerFv;
    undefinedFunction isPushable__12LivingEntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction awardKillScore__6EntityFQ2_5boost25shared_ptr__tm__8_6EntityiPC12DamageSource;
    undefinedFunction shouldRender__6EntityFdN21;
    undefinedFunction shouldRender__6EntityFd;
    undefinedFunction shouldRenderAtSqrDistance__6PlayerFd;
    undefinedFunction save__6EntityFP11CompoundTag;
    undefinedFunction load__6EntityFP11CompoundTag;
    undefinedFunction shouldTick__6PlayerFv;
    undefinedFunction repositionEntityAfterLoad__6EntityFv;
    undefinedFunction readAdditionalSaveData__6PlayerFP11CompoundTag;
    undefinedFunction addAdditonalSaveData__6PlayerFP11CompoundTag;
    undefinedFunction readAdditionContructionTag__6EntityFP11CompoundTag_9;
    undefinedFunction getAdditionContructionTag__6EntityFv;
    undefinedFunction spawnAtLocation__6EntityFP4Itemi;
    undefinedFunction spawnAtLocation__6EntityFP4Itemif;
    undefinedFunction spawnAtLocation__6EntityF35not_null_ptr__tm__15_12ItemInstancef;
    undefinedFunction isAlive__12LivingEntityFv;
    undefinedFunction isInWall__6PlayerFv;
    undefinedFunction interact__6EntityFRCQ2_5boost25shared_ptr__tm__8_6PlayerQ2_15InteractionHand16EInteractionHand;
    undefinedFunction getCollideAgainstBox__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction rideTick__6PlayerFv;
    undefinedFunction positionRider__6EntityFRCQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction onPassengerTurned__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction getRidingHeight__6PlayerFv;
    undefinedFunction getRideHeight__6EntityFv;
    undefinedFunction showVehicleHealth__6EntityFv;
    undefinedFunction startRiding__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction startRiding__6EntityFQ2_5boost25shared_ptr__tm__8_6Entityb;
    undefinedFunction GetInteractTooltip__6EntityFRC23EntityTooltipDataHolder;
    undefinedFunction GetHitTooltip__6EntityFRC23EntityTooltipDataHolder;
    undefinedFunction HideUseTooltips__6EntityFv;
    undefinedFunction canRide__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction ejectPassengers__6EntityFv;
    undefinedFunction stopRiding__6PlayerFv;
    undefinedFunction stopRidingBeforeTeleport__6EntityFv;
    undefinedFunction addPassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction removePassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction canAddPassenger__6EntityFQ2_5boost25shared_ptr__tm__8_6Entity;
    undefinedFunction lerpTo__12LivingEntityFdN21fT4ib;
    undefinedFunction getPickRadius__6EntityFv;
    undefinedFunction getLookAngle__6EntityFv;
    undefinedFunction getRotationVector__6EntityFv; // 0x1C4

    Vec3* (*getForward)(Player* player); // 0x1C8

    undefinedFunction handleInsidePortal__6EntityFRC8BlockPos; // 0x1CC
    undefinedFunction getDimensionChangingDelay__6PlayerFv;
    undefinedFunction lerpMotion__6EntityFdN21;
    undefinedFunction handleEntityEvent__6PlayerFUci;
    undefinedFunction animateHurt__12LivingEntityFv;
    undefinedFunction getHandSlots__6PlayerFv;
    undefinedFunction getArmorSlots__6PlayerFv;
    undefinedFunction getAllSlots__6EntityFv;
    undefinedFunction setItemSlot__6PlayerFPC13EquipmentSlot35not_null_ptr__tm__15_12ItemInstance;
    undefinedFunction isOnFire__6EntityFv;
    undefinedFunction isPassenger__6EntityFv;
    undefinedFunction isVehicle__6EntityFv;
    undefinedFunction isSneaking__6EntityFv;
    undefinedFunction setSneaking__6EntityFb;
    undefinedFunction isIdle__6EntityFv;
    undefinedFunction setIsIdle__6EntityFb;
    undefinedFunction isSprinting__6EntityFv;
    undefinedFunction setSprinting__12LivingEntityFb;
    undefinedFunction isSwimming__6EntityFv;
